analysis/results/mongodb/log_mongodb_a_fault.txt
/opt/java/openjdk/bin/java -cp /opt/ycsb/mongodb-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/core-0.17.0.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/opt/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/opt/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/opt/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/opt/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/opt/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -P /workloads/workload_a.properties -p mongodb.url=mongodb://mongo1:27017,mongo2:27017,mongo3:27017/ycsb?replicaSet=ycsb-rs -p mongodb.writeConcern=majority -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -s -t
Command line: -db site.ycsb.db.MongoDbClient -P /workloads/workload_a.properties -p mongodb.url=mongodb://mongo1:27017,mongo2:27017,mongo3:27017/ycsb?replicaSet=ycsb-rs -p mongodb.writeConcern=majority -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -s -t
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-23 10:02:24:573 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongo1:27017,mongo2:27017,mongo3:27017/ycsb?replicaSet=ycsb-rs&w=majority
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-23 10:02:34:538 10 sec: 6991 operations; 699.03 current ops/sec; est completion in 23 minutes [READ: Count=3513, Max=157183, Min=235, Avg=3531.47, 90=4479, 99=47327, 99.9=153343, 99.99=157183] [UPDATE: Count=3517, Max=333055, Min=6112, Avg=39805.28, 90=69567, 99=172287, 99.9=179071, 99.99=333055] 
2026-05-23 10:02:44:536 19 sec: 20860 operations; 1387.32 current ops/sec; est completion in 15 minutes [READ: Count=6944, Max=305919, Min=215, Avg=1752.52, 90=2799, 99=8999, 99.9=76607, 99.99=253695] [UPDATE: Count=6897, Max=972799, Min=5120, Avg=21306.13, 90=26159, 99=164607, 99.9=936959, 99.99=971263] 
2026-05-23 10:02:54:536 29 sec: 32880 operations; 1201.88 current ops/sec; est completion in 14 minutes [READ: Count=6030, Max=66111, Min=262, Avg=1795.72, 90=3109, 99=12175, 99.9=57791, 99.99=64895] [UPDATE: Count=5979, Max=172799, Min=5196, Avg=19724.6, 90=33855, 99=73279, 99.9=169215, 99.99=170495] 
2026-05-23 10:03:04:536 39 sec: 46964 operations; 1408.54 current ops/sec; est completion in 13 minutes [READ: Count=7082, Max=95743, Min=229, Avg=1164.98, 90=1879, 99=5455, 99.9=52415, 99.99=64735] [UPDATE: Count=7002, Max=4464639, Min=3120, Avg=26054.31, 90=21711, 99=83135, 99.9=4440063, 99.99=4464639] 
2026-05-23 10:03:14:534 49 sec: 62475 operations; 1551.26 current ops/sec; est completion in 12 minutes [READ: Count=7690, Max=1395711, Min=228, Avg=1201.46, 90=1604, 99=5867, 99.9=40863, 99.99=61439] [UPDATE: Count=7821, Max=272895, Min=3910, Avg=12829.15, 90=15887, 99=64127, 99.9=266751, 99.99=271615] 
2026-05-23 10:03:24:534 59 sec: 73587 operations; 1111.31 current ops/sec; est completion in 12 minutes [READ: Count=5595, Max=59039, Min=212, Avg=1318.85, 90=1812, 99=20607, 99.9=47135, 99.99=49823] [UPDATE: Count=5527, Max=5873663, Min=3254, Avg=36700.25, 90=56447, 99=101055, 99.9=5869567, 99.99=5873663] 
2026-05-23 10:03:34:534 69 sec: 90841 operations; 1725.23 current ops/sec; est completion in 11 minutes [READ: Count=8653, Max=74943, Min=188, Avg=1327.01, 90=1911, 99=8655, 99.9=59263, 99.99=70463] [UPDATE: Count=8594, Max=527359, Min=3592, Avg=17261.87, 90=28879, 99=81151, 99.9=523519, 99.99=526847] 
2026-05-23 10:03:44:532 79 sec: 100629 operations; 979 current ops/sec; est completion in 11 minutes [READ: Count=4925, Max=296703, Min=229, Avg=1413.6, 90=1988, 99=13671, 99.9=46079, 99.99=296703] [UPDATE: Count=4860, Max=1758207, Min=4004, Avg=31303.48, 90=27951, 99=525311, 99.9=1741823, 99.99=1758207] 
2026-05-23 10:03:54:532 89 sec: 116610 operations; 1598.1 current ops/sec; est completion in 11 minutes [READ: Count=7966, Max=177919, Min=229, Avg=1573.94, 90=1939, 99=23567, 99.9=67711, 99.99=173311] [UPDATE: Count=8019, Max=471551, Min=2972, Avg=18472.24, 90=40671, 99=87551, 99.9=457215, 99.99=471039] 
2026-05-23 10:04:04:532 99 sec: 128338 operations; 1172.8 current ops/sec; est completion in 11 minutes [READ: Count=5902, Max=1587199, Min=255, Avg=1924.4, 90=2587, 99=15183, 99.9=61119, 99.99=75071] [UPDATE: Count=5822, Max=1774591, Min=4496, Avg=23330.63, 90=33503, 99=81087, 99.9=1678335, 99.99=1773567] 
2026-05-23 10:04:14:531 109 sec: 137725 operations; 938.89 current ops/sec; est completion in 11 minutes [READ: Count=4655, Max=148735, Min=263, Avg=2060.34, 90=3315, 99=12231, 99.9=130687, 99.99=148735] [UPDATE: Count=4732, Max=3119103, Min=4828, Avg=34367.03, 90=44767, 99=226175, 99.9=3112959, 99.99=3119103] 
2026-05-23 10:04:24:530 119 sec: 146188 operations; 846.3 current ops/sec; est completion in 11 minutes [READ: Count=4167, Max=460799, Min=251, Avg=2037.86, 90=3191, 99=21343, 99.9=49951, 99.99=460799] [UPDATE: Count=4302, Max=2418687, Min=4012, Avg=35268.68, 90=51807, 99=343039, 99.9=1951743, 99.99=2418687] 
2026-05-23 10:04:34:530 129 sec: 152899 operations; 671.1 current ops/sec; est completion in 12 minutes [READ: Count=3345, Max=5165055, Min=335, Avg=7143.48, 90=3119, 99=9223, 99.9=2740223, 99.99=5165055] [UPDATE: Count=3360, Max=77631, Min=6040, Avg=18512.87, 90=28975, 99=63263, 99.9=75583, 99.99=77631] 
2026-05-23 10:04:44:528 139 sec: 164180 operations; 1128.33 current ops/sec; est completion in 11 minutes [READ: Count=5601, Max=53407, Min=223, Avg=1407.67, 90=2401, 99=7583, 99.9=49183, 99.99=53183] [UPDATE: Count=5680, Max=7856127, Min=4320, Avg=39689.49, 90=23103, 99=68735, 99.9=7843839, 99.99=7856127] 
2026-05-23 10:04:54:529 149 sec: 173367 operations; 918.7 current ops/sec; est completion in 11 minutes [READ: Count=4609, Max=1579007, Min=249, Avg=1966.91, 90=2595, 99=9823, 99.9=55615, 99.99=1579007] [UPDATE: Count=4591, Max=4366335, Min=4752, Avg=32995.02, 90=35871, 99=78847, 99.9=4329471, 99.99=4366335] 
2026-05-23 10:05:06:242 159 sec: 182043 operations; 867.6 current ops/sec; est completion in 11 minutes [READ: Count=4294, Max=1721343, Min=282, Avg=2644.25, 90=3285, 99=11079, 99.9=60799, 99.99=1721343] [UPDATE: Count=4370, Max=2568191, Min=5032, Avg=32723.4, 90=34239, 99=81663, 99.9=2566143, 99.99=2568191] 
2026-05-23 10:05:14:527 169 sec: 190893 operations; 885.09 current ops/sec; est completion in 12 minutes [READ: Count=4521, Max=2010111, Min=270, Avg=3621.8, 90=2741, 99=21695, 99.9=69119, 99.99=2010111] [UPDATE: Count=4328, Max=3424255, Min=5348, Avg=32663.51, 90=54975, 99=205055, 99.9=3301375, 99.99=3424255] 
2026-05-23 10:05:24:528 179 sec: 198083 operations; 719 current ops/sec; est completion in 12 minutes [READ: Count=3585, Max=417279, Min=246, Avg=2595.82, 90=2299, 99=48479, 99.9=140287, 99.99=417279] [UPDATE: Count=3605, Max=875007, Min=5020, Avg=43820.19, 90=112063, 99=392191, 99.9=873471, 99.99=875007] 
2026-05-23 10:05:34:528 189 sec: 207938 operations; 985.4 current ops/sec; est completion in 12 minutes [READ: Count=4895, Max=143103, Min=211, Avg=1787.89, 90=2811, 99=15599, 99.9=57119, 99.99=143103] [UPDATE: Count=4960, Max=1908735, Min=4752, Avg=30509.34, 90=55263, 99=185599, 99.9=1901567, 99.99=1908735] 
2026-05-23 10:05:44:526 199 sec: 217232 operations; 929.68 current ops/sec; est completion in 12 minutes [READ: Count=4625, Max=56703, Min=240, Avg=1316.9, 90=2507, 99=5903, 99.9=28767, 99.99=56703] [UPDATE: Count=4669, Max=4141055, Min=4896, Avg=30071.39, 90=21615, 99=70975, 99.9=4134911, 99.99=4141055] 
2026-05-23 10:05:54:525 209 sec: 225561 operations; 832.9 current ops/sec; est completion in 12 minutes [READ: Count=4128, Max=32559, Min=243, Avg=1566.5, 90=2783, 99=9735, 99.9=29727, 99.99=32559] [UPDATE: Count=4205, Max=6062079, Min=6048, Avg=39712.14, 90=23567, 99=87231, 99.9=6057983, 99.99=6062079] 
2026-05-23 10:06:04:525 219 sec: 231038 operations; 547.7 current ops/sec; est completion in 12 minutes [READ: Count=2738, Max=1447935, Min=270, Avg=2507.52, 90=2753, 99=28991, 99.9=72959, 99.99=1447935] [UPDATE: Count=2736, Max=6537215, Min=4412, Avg=55947.88, 90=41535, 99=95295, 99.9=6455295, 99.99=6537215] 
2026-05-23 10:06:14:523 229 sec: 242643 operations; 1160.73 current ops/sec; est completion in 11 minutes [READ: Count=5852, Max=54399, Min=219, Avg=1546.81, 90=2657, 99=7843, 99.9=47583, 99.99=50047] [UPDATE: Count=5752, Max=1778687, Min=4616, Avg=26151.18, 90=52735, 99=92031, 99.9=1744895, 99.99=1770495] 
2026-05-23 10:06:24:525 239 sec: 254968 operations; 1232.38 current ops/sec; est completion in 11 minutes [READ: Count=6160, Max=136319, Min=205, Avg=1571.65, 90=2347, 99=7143, 99.9=96255, 99.99=134655] [UPDATE: Count=6166, Max=1647615, Min=4010, Avg=24428.06, 90=33375, 99=207615, 99.9=1606655, 99.99=1646591] 
2026-05-23 10:06:34:523 249 sec: 266948 operations; 1198.12 current ops/sec; est completion in 11 minutes [READ: Count=5930, Max=2123775, Min=263, Avg=2514.46, 90=2637, 99=7263, 99.9=44031, 99.99=2123775] [UPDATE: Count=6049, Max=2838527, Min=5048, Avg=21962.66, 90=21887, 99=65407, 99.9=2689023, 99.99=2836479] 
2026-05-23 10:06:44:521 259 sec: 276943 operations; 999.7 current ops/sec; est completion in 11 minutes [READ: Count=5025, Max=1120255, Min=231, Avg=2008.67, 90=2505, 99=14759, 99.9=52799, 99.99=1120255] [UPDATE: Count=4974, Max=4636671, Min=4688, Avg=32571.74, 90=30687, 99=74047, 99.9=4628479, 99.99=4636671] 
2026-05-23 10:06:54:521 269 sec: 282775 operations; 583.2 current ops/sec; est completion in 11 minutes [READ: Count=2887, Max=454655, Min=250, Avg=1993.58, 90=2373, 99=6751, 99.9=443391, 99.99=454655] [UPDATE: Count=2941, Max=3139583, Min=4828, Avg=46100.15, 90=35935, 99=2119679, 99.9=3137535, 99.99=3139583] 
2026-05-23 10:07:04:521 279 sec: 297204 operations; 1442.9 current ops/sec; est completion in 11 minutes [READ: Count=7164, Max=1003519, Min=219, Avg=1877.13, 90=2427, 99=8343, 99.9=52671, 99.99=999423] [UPDATE: Count=7265, Max=1918975, Min=4736, Avg=21153.13, 90=29151, 99=72127, 99.9=1911807, 99.99=1918975] 
2026-05-23 10:07:14:520 289 sec: 309167 operations; 1196.54 current ops/sec; est completion in 10 minutes [READ: Count=6038, Max=188799, Min=253, Avg=1878.52, 90=2717, 99=8255, 99.9=104319, 99.99=188415] [UPDATE: Count=5935, Max=1154047, Min=4944, Avg=26957.66, 90=53983, 99=196095, 99.9=1146879, 99.99=1150975] 
2026-05-23 10:07:24:520 299 sec: 317676 operations; 850.9 current ops/sec; est completion in 10 minutes [READ: Count=4234, Max=62271, Min=250, Avg=1766.39, 90=2885, 99=12647, 99.9=56607, 99.99=62271] [UPDATE: Count=4266, Max=4870143, Min=5796, Avg=35721.62, 90=30895, 99=75263, 99.9=4853759, 99.99=4870143] 
2026-05-23 10:07:34:520 309 sec: 327881 operations; 1020.4 current ops/sec; est completion in 10 minutes [READ: Count=5025, Max=1019391, Min=271, Avg=2550.68, 90=2513, 99=13719, 99.9=201983, 99.99=986111] [UPDATE: Count=5180, Max=2271231, Min=4988, Avg=28396.45, 90=37631, 99=175487, 99.9=2265087, 99.99=2271231] 
2026-05-23 10:07:44:518 319 sec: 335488 operations; 760.85 current ops/sec; est completion in 10 minutes [READ: Count=3821, Max=1756159, Min=230, Avg=3229.18, 90=2747, 99=46111, 99.9=101759, 99.99=1756159] [UPDATE: Count=3787, Max=2455551, Min=5084, Avg=38981.68, 90=64127, 99=98623, 99.9=2451455, 99.99=2455551] 
2026-05-23 10:07:54:519 329 sec: 347783 operations; 1229.5 current ops/sec; est completion in 10 minutes [READ: Count=6207, Max=122431, Min=285, Avg=1583.44, 90=2535, 99=6907, 99.9=51391, 99.99=95167] [UPDATE: Count=6086, Max=110975, Min=5116, Avg=16550.18, 90=23039, 99=60575, 99.9=105151, 99.99=110591] 
2026-05-23 10:08:04:518 339 sec: 359490 operations; 1170.7 current ops/sec; est completion in 10 minutes [READ: Count=5849, Max=53151, Min=240, Avg=1544.27, 90=2167, 99=20831, 99.9=48959, 99.99=52031] [UPDATE: Count=5870, Max=5005311, Min=4440, Avg=34118.44, 90=59615, 99=80447, 99.9=4997119, 99.99=5001215] 
2026-05-23 10:08:14:515 349 sec: 368136 operations; 864.95 current ops/sec; est completion in 10 minutes [READ: Count=4293, Max=142719, Min=244, Avg=1772.78, 90=2739, 99=9383, 99.9=101183, 99.99=142719] [UPDATE: Count=4341, Max=2906111, Min=4508, Avg=29749.47, 90=28751, 99=115455, 99.9=2895871, 99.99=2906111] 
2026-05-23 10:08:24:515 359 sec: 373041 operations; 490.45 current ops/sec; est completion in 10 minutes [READ: Count=2486, Max=918015, Min=266, Avg=2790.3, 90=3715, 99=16007, 99.9=138495, 99.99=918015] [UPDATE: Count=2419, Max=5767167, Min=5360, Avg=71865.83, 90=44895, 99=2258943, 99.9=5648383, 99.99=5767167] 
2026-05-23 10:08:34:515 369 sec: 382964 operations; 992.4 current ops/sec; est completion in 9 minutes [READ: Count=4883, Max=242943, Min=231, Avg=1863.38, 90=3173, 99=11335, 99.9=64287, 99.99=242943] [UPDATE: Count=5040, Max=1742847, Min=5116, Avg=30349.59, 90=40863, 99=283903, 99.9=1740799, 99.99=1741823] 
2026-05-23 10:08:44:514 379 sec: 394514 operations; 1155 current ops/sec; est completion in 9 minutes [READ: Count=5865, Max=73471, Min=298, Avg=1980.31, 90=3505, 99=13671, 99.9=51295, 99.99=57887] [UPDATE: Count=5685, Max=220671, Min=5384, Avg=23404.27, 90=45695, 99=96767, 99.9=210815, 99.99=220031] 
2026-05-23 10:08:54:514 389 sec: 402041 operations; 752.78 current ops/sec; est completion in 9 minutes [READ: Count=3670, Max=774655, Min=228, Avg=1818.01, 90=2457, 99=21183, 99.9=47935, 99.99=774655] [UPDATE: Count=3857, Max=3209215, Min=4540, Avg=43302.45, 90=54591, 99=351999, 99.9=3155967, 99.99=3209215] 
2026-05-23 10:09:04:514 399 sec: 402667 operations; 62.6 current ops/sec; est completion in 9 minutes [READ: Count=327, Max=1371135, Min=265, Avg=8161.51, 90=7019, 99=45087, 99.9=1371135, 99.99=1371135] [UPDATE: Count=299, Max=6709247, Min=10624, Avg=529253.78, 90=1087487, 99=6672383, 99.9=6709247, 99.99=6709247] 
2026-05-23 10:09:14:512 409 sec: 408337 operations; 567.06 current ops/sec; est completion in 9 minutes [READ: Count=2805, Max=231295, Min=250, Avg=3557.67, 90=7279, 99=41983, 99.9=63839, 99.99=231295] [UPDATE: Count=2873, Max=343807, Min=8032, Avg=52463.65, 90=111999, 99=197247, 99.9=342015, 99.99=343807] 
2026-05-23 10:09:24:512 419 sec: 421884 operations; 1354.7 current ops/sec; est completion in 9 minutes [READ: Count=6776, Max=105279, Min=292, Avg=2104.02, 90=3711, 99=15743, 99.9=49887, 99.99=89279] [UPDATE: Count=6763, Max=844799, Min=5868, Avg=21490.81, 90=32287, 99=74559, 99.9=765439, 99.99=842751] 
2026-05-23 10:09:34:513 429 sec: 433450 operations; 1156.6 current ops/sec; est completion in 9 minutes [READ: Count=5780, Max=548351, Min=247, Avg=2382.76, 90=3053, 99=17375, 99.9=270335, 99.99=302335] [UPDATE: Count=5787, Max=816639, Min=4388, Avg=25281.71, 90=43327, 99=293119, 99.9=809983, 99.99=815103] 
2026-05-23 10:09:44:510 439 sec: 438759 operations; 531.01 current ops/sec; est completion in 9 minutes [READ: Count=2638, Max=1028607, Min=233, Avg=1744.16, 90=2349, 99=6371, 99.9=41503, 99.99=1028607] [UPDATE: Count=2675, Max=6823935, Min=4772, Avg=58111.5, 90=39839, 99=84863, 99.9=6819839, 99.99=6823935] 
2026-05-23 10:09:54:511 449 sec: 453652 operations; 1489.3 current ops/sec; est completion in 9 minutes [READ: Count=7432, Max=70655, Min=219, Avg=1508, 90=2691, 99=8031, 99.9=44063, 99.99=63263] [UPDATE: Count=7456, Max=1591295, Min=4876, Avg=19935.73, 90=24607, 99=65599, 99.9=1588223, 99.99=1590271] 
2026-05-23 10:10:04:511 459 sec: 460643 operations; 699.1 current ops/sec; est completion in 8 minutes [READ: Count=3536, Max=974847, Min=246, Avg=1524.58, 90=2047, 99=5679, 99.9=36575, 99.99=974847] [UPDATE: Count=3455, Max=6647807, Min=4172, Avg=44695.86, 90=17967, 99=183295, 99.9=6643711, 99.99=6647807] 
2026-05-23 10:10:14:509 469 sec: 471573 operations; 1093.11 current ops/sec; est completion in 8 minutes [READ: Count=5490, Max=66623, Min=239, Avg=1644.4, 90=2579, 99=17455, 99.9=47711, 99.99=53663] [UPDATE: Count=5440, Max=1720319, Min=4724, Avg=21161.17, 90=54719, 99=82687, 99.9=159487, 99.99=1720319] 
2026-05-23 10:10:24:509 479 sec: 485805 operations; 1423.2 current ops/sec; est completion in 8 minutes [READ: Count=7210, Max=1193983, Min=240, Avg=1886.77, 90=2683, 99=10079, 99.9=45855, 99.99=1193983] [UPDATE: Count=7022, Max=3743743, Min=5044, Avg=25954.07, 90=35135, 99=85759, 99.9=3741695, 99.99=3743743] 
2026-05-23 10:10:34:509 489 sec: 492766 operations; 696.1 current ops/sec; est completion in 8 minutes [READ: Count=3557, Max=905727, Min=300, Avg=2038.39, 90=2761, 99=23775, 99.9=51423, 99.99=905727] [UPDATE: Count=3404, Max=4089855, Min=5332, Avg=25630.47, 90=29455, 99=71039, 99.9=4079615, 99.99=4089855] 
2026-05-23 10:10:44:505 499 sec: 506080 operations; 1331.93 current ops/sec; est completion in 8 minutes [READ: Count=6632, Max=128767, Min=197, Avg=1425.24, 90=2623, 99=7911, 99.9=35391, 99.99=42239] [UPDATE: Count=6682, Max=7585791, Min=4504, Avg=29852.23, 90=25951, 99=53375, 99.9=7434239, 99.99=7585791] 
2026-05-23 10:10:54:505 509 sec: 514746 operations; 866.6 current ops/sec; est completion in 8 minutes [READ: Count=4287, Max=231551, Min=222, Avg=1708.58, 90=1968, 99=6519, 99.9=148479, 99.99=231551] [UPDATE: Count=4379, Max=5447679, Min=3432, Avg=38603.98, 90=22607, 99=191615, 99.9=5357567, 99.99=5447679] 
2026-05-23 10:11:04:505 519 sec: 523226 operations; 848 current ops/sec; est completion in 7 minutes [READ: Count=4329, Max=444927, Min=245, Avg=1856.27, 90=2645, 99=23135, 99.9=58463, 99.99=444927] [UPDATE: Count=4155, Max=2803711, Min=4564, Avg=36559.78, 90=64575, 99=153727, 99.9=2793471, 99.99=2803711] 
2026-05-23 10:11:14:505 529 sec: 538567 operations; 1534.1 current ops/sec; est completion in 7 minutes [READ: Count=7620, Max=75775, Min=213, Avg=1735.31, 90=2955, 99=12951, 99.9=49087, 99.99=75455] [UPDATE: Count=7717, Max=211967, Min=4488, Avg=18996.49, 90=35295, 99=78591, 99.9=200319, 99.99=209663] 
2026-05-23 10:11:24:505 539 sec: 543666 operations; 509.9 current ops/sec; est completion in 7 minutes [READ: Count=2537, Max=58079, Min=257, Avg=1274.43, 90=2235, 99=4591, 99.9=38015, 99.99=58079] [UPDATE: Count=2570, Max=7458815, Min=5216, Avg=61042.13, 90=19375, 99=105087, 99.9=7450623, 99.99=7458815] 
2026-05-23 10:11:34:505 549 sec: 553944 operations; 1027.8 current ops/sec; est completion in 7 minutes [READ: Count=5124, Max=795135, Min=222, Avg=2411.91, 90=2359, 99=18399, 99.9=122943, 99.99=794111] [UPDATE: Count=5147, Max=1755135, Min=4524, Avg=28650.42, 90=56671, 99=191103, 99.9=1537023, 99.99=1628159] 
2026-05-23 10:11:44:503 559 sec: 561727 operations; 778.53 current ops/sec; est completion in 7 minutes [READ: Count=3809, Max=51263, Min=248, Avg=1645.03, 90=2899, 99=8431, 99.9=42975, 99.99=51263] [UPDATE: Count=3973, Max=89535, Min=5348, Avg=19809.7, 90=41823, 99=75135, 99.9=83903, 99.99=89535] 
2026-05-23 10:11:54:503 569 sec: 576611 operations; 1488.4 current ops/sec; est completion in 6 minutes [READ: Count=7496, Max=200191, Min=234, Avg=1494.71, 90=2509, 99=6531, 99.9=60127, 99.99=143487] [UPDATE: Count=7388, Max=5119999, Min=4272, Avg=30275.35, 90=32351, 99=164479, 99.9=5107711, 99.99=5115903] 
2026-05-23 10:12:04:502 579 sec: 588783 operations; 1217.2 current ops/sec; est completion in 6 minutes [READ: Count=6122, Max=565759, Min=273, Avg=1651, 90=2697, 99=7395, 99.9=40831, 99.99=49183] [UPDATE: Count=6050, Max=2664447, Min=4956, Avg=24755.39, 90=32927, 99=74879, 99.9=2652159, 99.99=2662399] 
2026-05-23 10:12:14:501 589 sec: 597549 operations; 876.69 current ops/sec; est completion in 6 minutes [READ: Count=4447, Max=567295, Min=216, Avg=2043.16, 90=2235, 99=14503, 99.9=564735, 99.99=567295] [UPDATE: Count=4322, Max=3311615, Min=3498, Avg=34925.77, 90=20223, 99=855039, 99.9=3276799, 99.99=3311615] 
2026-05-23 10:12:24:501 599 sec: 612925 operations; 1537.6 current ops/sec; est completion in 6 minutes [READ: Count=7623, Max=177279, Min=191, Avg=2299.53, 90=3767, 99=31711, 99.9=62111, 99.99=89663] [UPDATE: Count=7750, Max=245247, Min=4120, Avg=18154.91, 90=31903, 99=75455, 99.9=183679, 99.99=243071] 
2026-05-23 10:12:34:501 609 sec: 617094 operations; 416.9 current ops/sec; est completion in 6 minutes [READ: Count=2105, Max=4607999, Min=253, Avg=8029.74, 90=2731, 99=46111, 99.9=2777087, 99.99=4607999] [UPDATE: Count=2066, Max=7544831, Min=5016, Avg=70036.66, 90=33279, 99=310015, 99.9=7544831, 99.99=7544831] 
2026-05-23 10:12:44:498 619 sec: 627536 operations; 1044.51 current ops/sec; est completion in 6 minutes [READ: Count=5180, Max=1202175, Min=235, Avg=2399.93, 90=2543, 99=40031, 99.9=183679, 99.99=197503] [UPDATE: Count=5260, Max=1404927, Min=4760, Avg=27977.83, 90=64159, 99=193151, 99.9=1395711, 99.99=1403903] 
2026-05-23 10:12:54:498 629 sec: 635576 operations; 804 current ops/sec; est completion in 6 minutes [READ: Count=4014, Max=69823, Min=237, Avg=2318.53, 90=3449, 99=42271, 99.9=58719, 99.99=69823] [UPDATE: Count=4026, Max=91007, Min=4872, Avg=19176.88, 90=49919, 99=72575, 99.9=84607, 99.99=91007] 
2026-05-23 10:13:04:498 639 sec: 645551 operations; 997.5 current ops/sec; est completion in 5 minutes [READ: Count=5004, Max=58591, Min=235, Avg=1746.35, 90=2955, 99=15391, 99.9=53535, 99.99=57599] [UPDATE: Count=4974, Max=9461759, Min=4728, Avg=45223.35, 90=23071, 99=65535, 99.9=9445375, 99.99=9461759] 
2026-05-23 10:13:14:497 649 sec: 658449 operations; 1290.06 current ops/sec; est completion in 5 minutes [READ: Count=6462, Max=243455, Min=255, Avg=2647.86, 90=4073, 99=39231, 99.9=95103, 99.99=243071] [UPDATE: Count=6442, Max=543743, Min=4728, Avg=22171.7, 90=41183, 99=129983, 99.9=490495, 99.99=494079] 
2026-05-23 10:13:24:496 659 sec: 667849 operations; 940 current ops/sec; est completion in 5 minutes [READ: Count=4730, Max=347647, Min=251, Avg=2349.13, 90=2919, 99=46495, 99.9=59615, 99.99=347647] [UPDATE: Count=4661, Max=368383, Min=4572, Avg=25548.46, 90=58623, 99=77375, 99.9=153471, 99.99=368383] 
2026-05-23 10:13:34:496 669 sec: 680356 operations; 1250.7 current ops/sec; est completion in 5 minutes [READ: Count=6199, Max=75519, Min=220, Avg=1842.86, 90=3083, 99=16215, 99.9=55327, 99.99=74751] [UPDATE: Count=6308, Max=4915199, Min=3890, Avg=28218.47, 90=26463, 99=75263, 99.9=4911103, 99.99=4915199] 
2026-05-23 10:13:44:496 679 sec: 682014 operations; 165.82 current ops/sec; est completion in 5 minutes [READ: Count=873, Max=913407, Min=301, Avg=5596.97, 90=2853, 99=21791, 99.9=912895, 99.99=913407] [UPDATE: Count=785, Max=4771839, Min=4588, Avg=96754.11, 90=29327, 99=4755455, 99.9=4771839, 99.99=4771839] 
2026-05-23 10:13:54:495 689 sec: 694586 operations; 1257.2 current ops/sec; est completion in 5 minutes [READ: Count=6299, Max=4624383, Min=223, Avg=3072.84, 90=2573, 99=16655, 99.9=53567, 99.99=4521983] [UPDATE: Count=6278, Max=6365183, Min=3622, Avg=35032.87, 90=22335, 99=66687, 99.9=4800511, 99.99=6365183] 
2026-05-23 10:14:04:495 699 sec: 707409 operations; 1282.3 current ops/sec; est completion in 4 minutes [READ: Count=6451, Max=168831, Min=275, Avg=1816.76, 90=2915, 99=19359, 99.9=52607, 99.99=56607] [UPDATE: Count=6367, Max=1677311, Min=4720, Avg=16252.1, 90=26207, 99=64159, 99.9=71167, 99.99=1668095] 
2026-05-23 10:14:14:492 709 sec: 721048 operations; 1364.31 current ops/sec; est completion in 4 minutes [READ: Count=6788, Max=145663, Min=239, Avg=1785.16, 90=3003, 99=17983, 99.9=54943, 99.99=58815] [UPDATE: Count=6851, Max=4984831, Min=4070, Avg=27309.87, 90=26143, 99=79423, 99.9=4980735, 99.99=4984831] 
2026-05-23 10:14:24:492 719 sec: 727410 operations; 636.2 current ops/sec; est completion in 4 minutes [READ: Count=3212, Max=754687, Min=248, Avg=2379.22, 90=2879, 99=16319, 99.9=373247, 99.99=754687] [UPDATE: Count=3150, Max=4118527, Min=4644, Avg=50034.36, 90=21007, 99=2547711, 99.9=4116479, 99.99=4118527] 
2026-05-23 10:14:34:492 729 sec: 738208 operations; 1079.8 current ops/sec; est completion in 4 minutes [READ: Count=5352, Max=376319, Min=265, Avg=2603.38, 90=3443, 99=36383, 99.9=141567, 99.99=322559] [UPDATE: Count=5447, Max=1113087, Min=4492, Avg=26814.42, 90=48447, 99=161023, 99.9=1025535, 99.99=1105919] 
2026-05-23 10:14:44:491 739 sec: 749294 operations; 1108.71 current ops/sec; est completion in 4 minutes [READ: Count=5508, Max=143615, Min=247, Avg=2332.42, 90=3267, 99=47071, 99.9=53983, 99.99=95487] [UPDATE: Count=5579, Max=608255, Min=3998, Avg=26362.15, 90=62687, 99=79615, 99.9=603647, 99.99=607743] 
2026-05-23 10:14:54:491 749 sec: 758871 operations; 957.7 current ops/sec; est completion in 3 minutes [READ: Count=4716, Max=1390591, Min=242, Avg=2104.35, 90=2459, 99=13415, 99.9=52063, 99.99=1390591] [UPDATE: Count=4859, Max=3438591, Min=4664, Avg=24684.86, 90=30879, 99=99711, 99.9=3432447, 99.99=3438591] 
2026-05-23 10:15:04:491 759 sec: 768986 operations; 1011.5 current ops/sec; est completion in 3 minutes [READ: Count=4999, Max=394495, Min=223, Avg=2077.76, 90=3083, 99=34015, 99.9=53023, 99.99=394495] [UPDATE: Count=5116, Max=8114175, Min=4100, Avg=35086.88, 90=25183, 99=67455, 99.9=8105983, 99.99=8110079] 
2026-05-23 10:15:14:489 769 sec: 777554 operations; 856.97 current ops/sec; est completion in 3 minutes [READ: Count=4249, Max=729087, Min=263, Avg=2084.16, 90=2869, 99=30719, 99.9=62047, 99.99=729087] [UPDATE: Count=4327, Max=5124095, Min=4776, Avg=34962.65, 90=31631, 99=80063, 99.9=5095423, 99.99=5124095] 
2026-05-23 10:15:24:489 779 sec: 784231 operations; 667.7 current ops/sec; est completion in 3 minutes [READ: Count=3283, Max=68031, Min=269, Avg=2300.37, 90=3329, 99=48063, 99.9=62559, 99.99=68031] [UPDATE: Count=3386, Max=804863, Min=4952, Avg=20903.13, 90=53695, 99=79743, 99.9=804351, 99.99=804863] 
2026-05-23 10:15:34:489 789 sec: 799532 operations; 1530.1 current ops/sec; est completion in 3 minutes [READ: Count=7679, Max=54495, Min=235, Avg=1820.87, 90=2913, 99=21199, 99.9=50495, 99.99=53823] [UPDATE: Count=7622, Max=6426623, Min=4468, Avg=29790.29, 90=34559, 99=68415, 99.9=6365183, 99.99=6422527] 
2026-05-23 10:15:44:487 799 sec: 809185 operations; 965.49 current ops/sec; est completion in 3 minutes [READ: Count=4836, Max=67967, Min=284, Avg=2222.64, 90=3591, 99=27215, 99.9=60927, 99.99=67967] [UPDATE: Count=4817, Max=1560575, Min=5448, Avg=22201.82, 90=35903, 99=86527, 99.9=588287, 99.99=1560575] 
2026-05-23 10:15:54:488 809 sec: 822521 operations; 1333.6 current ops/sec; est completion in 2 minutes [READ: Count=6671, Max=922623, Min=227, Avg=2013.04, 90=3023, 99=12967, 99.9=56287, 99.99=922111] [UPDATE: Count=6665, Max=3883007, Min=4108, Avg=23730.82, 90=23871, 99=69759, 99.9=3874815, 99.99=3876863] 
2026-05-23 10:16:04:487 819 sec: 823740 operations; 121.9 current ops/sec; est completion in 2 minutes [READ: Count=601, Max=524287, Min=266, Avg=2332.45, 90=1839, 99=20351, 99.9=132735, 99.99=524287] [UPDATE: Count=627, Max=11141119, Min=5300, Avg=302374.41, 90=17039, 99=11067391, 99.9=11075583, 99.99=11141119] 
2026-05-23 10:16:14:485 829 sec: 837316 operations; 1357.87 current ops/sec; est completion in 2 minutes [READ: Count=6863, Max=209791, Min=232, Avg=1952.04, 90=2839, 99=33855, 99.9=56319, 99.99=61151] [UPDATE: Count=6716, Max=2697215, Min=4100, Avg=21816.69, 90=27423, 99=66623, 99.9=2693119, 99.99=2695167] 
2026-05-23 10:16:24:485 839 sec: 850144 operations; 1282.8 current ops/sec; est completion in 2 minutes [READ: Count=6430, Max=84415, Min=262, Avg=2239.3, 90=3355, 99=36703, 99.9=59679, 99.99=67583] [UPDATE: Count=6386, Max=639999, Min=4676, Avg=18772.95, 90=39263, 99=69631, 99.9=79359, 99.99=639487] 
2026-05-23 10:16:34:485 849 sec: 860465 operations; 1032.1 current ops/sec; est completion in 2 minutes [READ: Count=5191, Max=121535, Min=229, Avg=1630.59, 90=2369, 99=22911, 99.9=52767, 99.99=58271] [UPDATE: Count=5130, Max=4120575, Min=3846, Avg=27715.52, 90=32703, 99=66111, 99.9=4116479, 99.99=4120575] 
2026-05-23 10:16:44:483 859 sec: 870956 operations; 1049.31 current ops/sec; est completion in 2 minutes [READ: Count=5192, Max=60895, Min=196, Avg=2116.04, 90=3591, 99=21919, 99.9=55519, 99.99=57503] [UPDATE: Count=5299, Max=4927487, Min=3946, Avg=34644.07, 90=47711, 99=71231, 99.9=4923391, 99.99=4923391] 
2026-05-23 10:16:54:483 869 sec: 883955 operations; 1299.9 current ops/sec; est completion in 1 minute [READ: Count=6556, Max=555007, Min=255, Avg=2199.64, 90=3081, 99=27903, 99.9=62719, 99.99=105599] [UPDATE: Count=6447, Max=842751, Min=4516, Avg=22603.68, 90=52095, 99=84543, 99.9=803839, 99.99=838655] 
2026-05-23 10:17:04:483 879 sec: 889915 operations; 596 current ops/sec; est completion in 1 minute [READ: Count=2953, Max=79103, Min=301, Avg=2874.61, 90=4239, 99=46111, 99.9=57439, 99.99=79103] [UPDATE: Count=3003, Max=121215, Min=5136, Avg=25263.8, 90=62047, 99=84607, 99.9=118847, 99.99=121215] 
2026-05-23 10:17:14:482 889 sec: 897538 operations; 762.38 current ops/sec; est completion in 1 minute [READ: Count=3814, Max=55423, Min=221, Avg=1428.73, 90=2245, 99=13031, 99.9=50175, 99.99=55423] [UPDATE: Count=3820, Max=11034623, Min=4388, Avg=60238.23, 90=24015, 99=65215, 99.9=11034623, 99.99=11034623] 
2026-05-23 10:17:24:482 899 sec: 910184 operations; 1264.6 current ops/sec; est completion in 1 minute [READ: Count=6388, Max=98815, Min=249, Avg=2355.06, 90=3891, 99=30527, 99.9=58495, 99.99=64127] [UPDATE: Count=6247, Max=1555455, Min=4816, Avg=23124.08, 90=35999, 99=99775, 99.9=1549311, 99.99=1552383] 
2026-05-23 10:17:34:482 909 sec: 917572 operations; 738.8 current ops/sec; est completion in 1 minute [READ: Count=3651, Max=400383, Min=263, Avg=2609.71, 90=3277, 99=46719, 99.9=60607, 99.99=400383] [UPDATE: Count=3737, Max=1606655, Min=5308, Avg=40192.71, 90=63455, 99=861183, 99.9=1598463, 99.99=1606655] 
2026-05-23 10:17:44:480 919 sec: 929720 operations; 1215.16 current ops/sec; est completion in 1 minute [READ: Count=6076, Max=403199, Min=223, Avg=1954.68, 90=2719, 99=23999, 99.9=104383, 99.99=178815] [UPDATE: Count=6072, Max=583679, Min=3392, Avg=22219.75, 90=43743, 99=196991, 99.9=575999, 99.99=578047] 
2026-05-23 10:17:54:480 929 sec: 936961 operations; 724.1 current ops/sec; est completion in 1 minute [READ: Count=3592, Max=909823, Min=207, Avg=2699.87, 90=2427, 99=31135, 99.9=142335, 99.99=909823] [UPDATE: Count=3652, Max=3969023, Min=3492, Avg=44907.55, 90=91583, 99=201727, 99.9=2367487, 99.99=3969023] 
2026-05-23 10:18:04:480 939 sec: 949838 operations; 1287.7 current ops/sec; est completion in 50 seconds [READ: Count=6494, Max=128895, Min=248, Avg=2330.39, 90=3515, 99=36319, 99.9=67967, 99.99=89407] [UPDATE: Count=6380, Max=525823, Min=4472, Avg=22570.78, 90=56927, 99=104895, 99.9=520959, 99.99=524031] 
2026-05-23 10:18:14:478 949 sec: 957095 operations; 725.77 current ops/sec; est completion in 43 seconds [READ: Count=3683, Max=933887, Min=227, Avg=3194.54, 90=2865, 99=48735, 99.9=263679, 99.99=933887] [UPDATE: Count=3574, Max=1751039, Min=4204, Avg=40742.06, 90=75007, 99=283135, 99.9=1727487, 99.99=1751039] 
2026-05-23 10:18:24:479 959 sec: 966848 operations; 975.3 current ops/sec; est completion in 33 seconds [READ: Count=4877, Max=185343, Min=248, Avg=1856.19, 90=3549, 99=13791, 99.9=44671, 99.99=185343] [UPDATE: Count=4876, Max=4759551, Min=4034, Avg=31557.62, 90=24975, 99=66047, 99.9=4755455, 99.99=4759551] 
2026-05-23 10:18:34:478 969 sec: 981491 operations; 1464.3 current ops/sec; est completion in 19 seconds [READ: Count=7282, Max=89279, Min=272, Avg=2415.5, 90=3757, 99=37279, 99.9=60543, 99.99=69055] [UPDATE: Count=7361, Max=284159, Min=4388, Avg=19339.34, 90=36479, 99=75711, 99.9=276735, 99.99=283903] 
2026-05-23 10:18:44:476 979 sec: 985007 operations; 351.67 current ops/sec; est completion in 15 seconds [READ: Count=1757, Max=174975, Min=249, Avg=2609.2, 90=3341, 99=45503, 99.9=57599, 99.99=174975] [UPDATE: Count=1759, Max=7593983, Min=5504, Avg=88068.69, 90=48191, 99=268543, 99.9=7446527, 99.99=7593983] 
2026-05-23 10:18:54:476 989 sec: 998702 operations; 1369.5 current ops/sec; est completion in 2 second [READ: Count=6912, Max=118079, Min=236, Avg=1574.15, 90=2503, 99=11367, 99.9=49567, 99.99=53279] [CLEANUP: Count=8, Max=8, Min=1, Avg=2.5, 90=2, 99=8, 99.9=8, 99.99=8] [UPDATE: Count=6783, Max=2471935, Min=3894, Avg=19172.84, 90=27263, 99=66495, 99.9=1768447, 99.99=2441215] 
2026-05-23 10:18:56:642 992 sec: 1000000 operations; 599.26 current ops/sec; [READ: Count=642, Max=57567, Min=294, Avg=1576.34, 90=1809, 99=29231, 99.9=56255, 99.99=57567] [CLEANUP: Count=8, Max=18895, Min=1, Avg=2362.75, 90=3, 99=18895, 99.9=18895, 99.99=18895] [UPDATE: Count=656, Max=74431, Min=3230, Avg=11684.57, 90=29119, 99=63711, 99.9=69887, 99.99=74431] 
[OVERALL], RunTime(ms), 992105
[OVERALL], Throughput(ops/sec), 1007.9578270445164
[TOTAL_GCS_G1_Young_Generation], Count, 165
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 917
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.09242973273998216
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 165
[TOTAL_GC_TIME], Time(ms), 917
[TOTAL_GC_TIME_%], Time(%), 0.09242973273998216
[READ], Operations, 499993
[READ], AverageLatency(us), 2063.264483702772
[READ], MinLatency(us), 188
[READ], MaxLatency(us), 5165055
[READ], 95thPercentileLatency(us), 4103
[READ], 99thPercentileLatency(us), 19295
[READ], Return=OK, 499993
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 1182.625
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 18895
[CLEANUP], 95thPercentileLatency(us), 8
[CLEANUP], 99thPercentileLatency(us), 18895
[UPDATE], Operations, 500007
[UPDATE], AverageLatency(us), 29561.676050535294
[UPDATE], MinLatency(us), 2972
[UPDATE], MaxLatency(us), 11141119
[UPDATE], 95thPercentileLatency(us), 60607
[UPDATE], 99thPercentileLatency(us), 147967
[UPDATE], Return=OK, 500007